# №3.1[17]. Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Примечание: Пользователь может вводить значения списка или список задан изначально.

# Примеры/Тесты:

# [1, 1, 2, 0, -1, 3, 4, 4] -> 6

# [1, 1, 2, 0, 1, 2, 1, 2] -> 3



list_1 = [10, 5, 7, 3, 3, 0, 5, 7, 2, 8]
set_1 = set(list_1)
print(set_1)
print(len(set_1))